bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_i2c.c
    /* set i2c clk,default is 400000,max support clk is 400000 */
    if (cfg->clk == 0 || cfg->clk > 400000) {
        I2C_ClockSet(i2cNo, 400000);
    } else {
        I2C_ClockSet(i2cNo, cfg->clk);
    }

    /* Disable clock gate when use I2C0 */
    GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_I2C);

    if (cfg->dataSize > 256) {
        cfg->dataSize = 256;
    }

    /* I2C write config */
    tmpVal = BL_RD_REG(I2Cx, I2C_CONFIG);

    if (direct == I2C_WRITE) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_PKT_DIR);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_PKT_DIR);
    }

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_SLV_ADDR, cfg->slaveAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_10B_ADDR_EN, cfg->slaveAddr10Bit);

    if (cfg->subAddrSize > 0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_SUB_ADDR_EN);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_SUB_ADDR_BC, cfg->subAddrSize - 1);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_SUB_ADDR_EN);
    }

    /* align clock when 1 master*/
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_SCL_SYNC_EN, DISABLE);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PKT_LEN, cfg->dataSize - 1);
    BL_WR_REG(I2Cx, I2C_CONFIG, tmpVal);

    /* Set sub address */
    BL_WR_REG(I2Cx, I2C_SUB_ADDR, cfg->subAddr);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(I2C_IRQn, I2C0_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  Set de-glitch function cycle count value
 *
 * @param  i2cNo: I2C ID type
 * @param  cnt: De-glitch function cycle count
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type I2C_SetDeglitchCount(I2C_ID_Type i2cNo, uint8_t cnt)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_CONFIG);

    if (cnt > 0) {
        /* enable de-glitch function */
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_DEG_EN);
    } else {
        /* disable de-glitch function */
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_DEG_EN);
    }

    /* Set count value */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_DEG_CNT, cnt);
    BL_WR_REG(I2Cx, I2C_CONFIG, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set i2c prd
 *
 * @param  i2cNo: I2C ID type
 * @param  phase: I2C phase value
 *
 * @return None
 *
*******************************************************************************/
void I2C_SetPrd(I2C_ID_Type i2cNo, uint8_t phase)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    //phase_cycles = (32000000 / phase / 4) - 1;
    tmpVal = BL_RD_REG(I2Cx, I2C_PRD_START);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_0, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_1, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_2, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_S_PH_3, phase);
    BL_WR_REG(I2Cx, I2C_PRD_START, tmpVal);
    tmpVal = BL_RD_REG(I2Cx, I2C_PRD_STOP);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_0, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_1, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_2, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_P_PH_3, phase);
    BL_WR_REG(I2Cx, I2C_PRD_STOP, tmpVal);
    tmpVal = BL_RD_REG(I2Cx, I2C_PRD_DATA);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_0, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_1, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_2, phase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, I2C_CR_I2C_PRD_D_PH_3, phase);
    BL_WR_REG(I2Cx, I2C_PRD_DATA, tmpVal);
}

/****************************************************************************/ /**
 * @brief  I2C set scl output clock
 *
 * @param  i2cNo: I2C ID type
 * @param  clk: Clock set
 *
 * @return None
 *
*******************************************************************************/
void I2C_ClockSet(I2C_ID_Type i2cNo, uint32_t clk)
{
    uint32_t bclk = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    bclk = GLB_Get_BCLK_Div();
    if (clk >= 100000) {
        GLB_Set_I2C_CLK(1, GLB_I2C_CLK_SRC_BCLK, 0);
        I2C_SetPrd(i2cNo, bclk / (clk * 4) - 1);
    } else if (clk >= 8000) {
        GLB_Set_I2C_CLK(1, GLB_I2C_CLK_SRC_BCLK, 9);
        I2C_SetPrd(i2cNo, bclk / 10 / (clk * 4) - 1);
    } else if (clk >= 800) {
        GLB_Set_I2C_CLK(1, GLB_I2C_CLK_SRC_BCLK, 99);
        I2C_SetPrd(i2cNo, bclk / 100 / (clk * 4) - 1);
    } else {
        GLB_Set_I2C_CLK(1, GLB_I2C_CLK_SRC_BCLK, 255);
        I2C_SetPrd(i2cNo, bclk / 256 / (clk * 4) - 1);
    }
}

/****************************************************************************/ /**
 * @brief  I2C set scl sync
 *
 * @param  i2cNo: I2C ID type
 * @param  enable: Enable or disable I2C scl sync
 *
 * @return None
 *
*******************************************************************************/
void I2C_SetSclSync(I2C_ID_Type i2cNo, uint8_t enable)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_CONFIG);

    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, I2C_CR_I2C_SCL_SYNC_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, I2C_CR_I2C_SCL_SYNC_EN);
    }

    BL_WR_REG(I2Cx, I2C_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get i2c busy state
 *
 * @param  i2cNo: I2C ID type
 *
 * @return RESET or SET
 *
*******************************************************************************/
BL_Sts_Type I2C_IsBusy(I2C_ID_Type i2cNo)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

    tmpVal = BL_RD_REG(I2Cx, I2C_BUS_BUSY);
    return ((BL_IS_REG_BIT_SET(tmpVal, I2C_STS_I2C_BUS_BUSY)) ? SET : RESET);
}

/****************************************************************************/ /**
 * @brief  Get i2c transfer end state
 *
 * @param  i2cNo: I2C ID type
 *
 * @return RESET or SET
 *
*******************************************************************************/
BL_Sts_Type I2C_TransferEndStatus(I2C_ID_Type i2cNo)
{
    uint32_t tmpVal;
    uint32_t I2Cx = I2C_BASE;

    /* Check the parameters */
    CHECK_PARAM(IS_I2C_ID_TYPE(i2cNo));

